app/controllers/api/v1/employees_controller.rb

    	def create
    		@employee = Employee.new(emp_params)
    		if @employee.save
---
INSERT INTO "employees" ("name", "salary", "rating", "manager_id", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Manesh"], ["salary", "10"], ["rating", "2"], ["manager_id", 20], ["role", "SDE"], ["created_at", "2021-05-18 02:32:53.586637"], ["updated_at", "2021-05-18 02:32:53.586637"]]

    	def top_paid_emps
    		@employees = Employee.order(salary: :desc).limit(10)
---
SELECT  "employees".* FROM "employees" WHERE "employees"."deleted_at" IS NULL ORDER BY "employees"."salary" DESC LIMIT ?  [["LIMIT", 10]]

      def emp_hierarchy
        emp_hierarchy_result = []
        Employee.top_execs.includes(subordinates: {subordinates: {subordinates: {subordinates: :subordinates}}}).each do |emp|
---
SELECT "employees".* FROM "employees" WHERE "employees"."deleted_at" IS NULL

      def destory
        @employee = Employee.find_by(id: params[:id])
        if @employee
          @employee.update(status: "Resigned")
---
SELECT  "employees".* FROM "employees" WHERE "employees"."deleted_at" IS NULL AND "employees"."id" = ? LIMIT ?  [["id", 50], ["LIMIT", 1]]
UPDATE "employees" SET "status" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["status", "Resigned"], ["updated_at", "2021-05-18 06:30:13.461719"], ["id", 9]]