app/models/employee.rb

	def ratio
		salary/Employee.pluck(:salary).sum
---
SELECT "employees"."salary" FROM "employees" WHERE "employees"."deleted_at" IS NULL

	def validate_manager
		emp = Employee.find_by(id: self.manager_id)
---
SELECT  "employees".* FROM "employees" WHERE "employees"."deleted_at" IS NULL AND "employees"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]